This is the example org-mode file used for the Denver Emacs org-mode
introduction talk. Everything in this talk should work without any custom
settings or installation with a reasonably recent Emacs version.

Let's start with a headline, this is kind of like Markdown's # character:

* Show off other features of org-mode if we have more time
Maybe not in excruciating detail, but we can show off the power and cover it in
more detail at a later time:

- refiling (=org-refile=)
- source code blocks
- org-babel
- clocking in/out
- table formulas
- custom agenda views
- capturing notes (not just TODOs)
- publishing projects remotely via TRAMP

#+BEGIN_LaTeX
$a + b$
#+END_LaTeX

#+BEGIN_SRC emacs-lisp
(defun my/function ()
  "docstring"
  (interactive)
  (progn
    (+ 1 1)
    (message "Hi")))
#+END_SRC

#+BEGIN_SRC sh :results table :var data="1 2 3 4"
echo $data > /tmp/foo
for i in `cat /tmp/foo`; do
  echo $i
done
#+END_SRC

#+RESULTS:
| 1 |
| 2 |
| 3 |
| 4 |

#+NAME: say-hi
#+BEGIN_SRC sh
echo "hi"
#+END_SRC

#+NAME: hi
#+RESULTS: say-hi
: hi


#+BEGIN_SRC sh
# do some things
echo "stuff"
echo "more stuff"
echo <<hi>>
#+END_SRC

#+RESULTS:

To enter and edit a block of text, use =C-c C-'=
